app/views/users/show.html.haml

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 4]]
---
  -# %strong='Tags: '
  -# - p[:photo].tags.each do |tag|