app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("user_id", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["photo_id", 2], ["created_at", "2018-11-19 22:47:48.246551"], ["updated_at", "2018-11-19 22:47:48.246551"]]
---
  def create
    @user = User.find(params[:comment][:user_id])
    @photo = Photo.find(params[:comment][:photo_id])
    @comment = Comment.create({user_id: params[:comment][:user_id], photo_id: params[:comment][:photo_id]})