app/controllers/photos_controller.rb

  def create
    @user = User.find(params[:user_id])

    if params[:photo][:image] == nil
      flash[:alert] = "Please upload a photo"
      redirect_to :back
    elsif params[:photo][:title].blank?
      flash[:alert] = "Please specify a title"
      redirect_to :back
    else
      @photo = Photo.create(photo_params)
      @photo.user_id = @user.id
      @photo.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2018-11-19 19:59:25.508764"], ["updated_at", "2018-11-19 19:59:25.508764"]]
UPDATE "photos" SET "user_id" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["user_id", 1], ["updated_at", "2018-11-19 19:59:25.527515"], ["id", 4]]

  def new
    @user = User.find(params[:user_id])
    logger.info "NEW #{@user}"
    @photo = Photo.create()
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-11-19 19:44:59.086263"], ["updated_at", "2018-11-19 19:44:59.086263"]]